Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--geonode_quickstart.tmx
Source language: en
Languages: ja

source: GeoNode Quickstart
ja: GeoNodeクイックスタート

source: Open Source Geospatial Content Management System
ja: オープンソース地理空間コンテンツ管理システム

source: GeoNode is a web-based application and platform for developing geospatial information systems (GIS) and for deploying spatial data infrastructures (SDI).
ja: GeoNodeは、地理空間情報システム(GIS)の開発および空間データインフラストラクチャ(SDI)の展開のためのWebベースのアプリケーションおよびプラットフォームです。

source: Start GeoNode
ja: GeoNodeを起動

source: To start GeoNode on your OSGeoLive DVD you have to choose :menuselection:`Geospatial --> Browser Clients --> GeoNode --> Start GeoNode` and after a few moments the GeoNode webpage will automatically open at http://geonode. The page will look like the image below.
ja: OSGeoLive DVD上でGeoNodeを起動するには、:menuselection:`Geospatial-->Browser Clients-->GeoNode-->Start GeoNode`を選択する必要があります。しばらくすると、GeoNodeのWebページがhttp://geonodeで自動的に開きます。ページは次のようになります。

source: Sign in as a registered user
ja: 登録ユーザーとしてサインイン

source: From the interface shown above, one can view and modify existing spatial layers and maps, as well as find information on other GeoNode users. But, without being logged in, you are limited to read-only access of public layers. In order to create a map and add layers to it, you have to sign in first.
ja: 上記のインターフェイスから、既存の空間レイヤとマップをビューおよび変更したり、他のGeoNodeユーザに関する情報を検索したりできます。しかし、ログインしていないと、パブリックレイヤーへの読み取り専用アクセスに制限されます。マップを作成してレイヤを追加するには、最初にサインインする必要があります。

source: From any page in the web interface, you will see a *Sign in* link on the top-right of the page. Click that link, and in the dialog that displays, fill in the user credentials. Try "admin" and "admin" for the Username and Password.
ja: Webインターフェイスの任意のページから、ページの右上に[*サインイン*]リンクが表示されます。そのリンクをクリックし、表示されるダイアログでユーザー認証情報を入力します。ユーザー名とパスワードに「admin」と「admin」を使用してみてください。

source: Add a new layer
ja: 新しいレイヤを追加

source: Layers are a published resource representing a raster or vector spatial data source. Layers also can be associated with metadata, ratings, and comments.
ja: レイヤーは、ラスタまたはベクタ空間データソースを表すパブリッシュされたリソースです。レイヤーはメタデータ、評価、コメントに関連付けることもできます。

source: To see existing layers, from the navigation bar on the top of any page, select *Data* menu and click on the *Layers* link.
ja: 既存のレイヤーを表示するには、ページの最上部にあるナビゲーションバーから[*データ*]メニューを選択し、[*レイヤー*]リンクをクリックします。

source: The result will look like this:
ja: 結果は次のようになります。

source: To add a layer to your account, select the *Upload* button on the top right of the *Layers* page:
ja: アカウントにレイヤを追加するには、*Layers*ページの右上にある*Upload*ボタンをクリックします。

source: In case you want to upload data from any other page, from the navigation bar, select *Data* menu and click on the *Upload Layers* link.
ja: 他のページからデータをアップロードする場合は、ナビゲーションバーから[*Data*]メニューを選択し、[*Upload Layers*]リンクをクリックします。

source: By clicking one of the above *Upload* links you will be brought to the upload page.
ja: 上記の[アップロード]リンクのいずれかをクリックすると、アップロードページが表示されます。

source: You have two possibilities to add your files. You can either do that by using *drag & drop* on the *Drop Files Here* area or you can use the *Choose Files* button to select them. Be aware that you have to upload a complete set of files, consisting of a *shp*, a *prj*, a *dbf* and a *shx* file. If one of them is missing, GeoNode will warn you before you upload them.
ja: ファイルを追加する方法は2つあります。これは、*Drop Files Here*領域の*ドラッグ&ドロップ*を使用するか、*Choose Files*ボタンを使用して選択できます。*shp*、*prj*、*dbf*、*shx*ファイルからなる完全なファイルセットをアップロードする必要があることに注意してください。いずれかが欠けていると、アップロード前にGeoNodeから警告が表示されます。

source: Now click *Choose Files* button and you'll see a file selection window. Navigate to :file:`/home/user/data/natural_earth2` folder and select all the :file:`ne_10m_admin_0_countries` files.
ja: 次に、[*ファイルを選択*]ボタンをクリックすると、ファイル選択ウィンドウが表示されます。:file:`/home/user/data/natural_earth2`フォルダに移動し、:file:`ne_10m_admin_0_countries`ファイルをすべて選択します。

source: You should now be able to see all the files you want to upload.
ja: これで、アップロードするすべてのファイルが表示されます。

source: GeoNode has the ability to restrict who can view, edit, and manage layers. On the right side of the page you can see the *Permission* section, where you can limit the access on your layer. Under *Who can view and download this data*, select *Any registered user*. This will ensure that anonymous view access is disabled. In the same area, under *Who can edit this data*, select your username. This will ensure that only you are able to edit the data in the layer.
ja: GeoNodeには、レイヤのビュー、編集、管理が可能なユーザを制限する機能があります。ページの右側には*Permission*セクションが表示され、レイヤのアクセスを制限できます。[*Who can view and download this data*]の下で、[*Any registered user*]を選択します。これにより、匿名のビューアクセスが無効になります。同じ領域で、[*Who can edit this data*]の下からユーザー名を選択します。これにより、レイヤのデータを編集できるのはあなただけになります。

source: To upload data, click the *Upload* button at the bottom.
ja: データをアップロードするには、下部の*Upload*ボタンをクリックします。

source: After the layer upload is completed, you can either preview the layer with *Layer Info* button, or edit the layer metadata with *Edit Metadata* or edit layer style on GeoServer with *Manage Styles* button.
ja: レイヤのアップロードが完了したら、*Layer Info*ボタンを使用してレイヤをプレビューするか、*Edit Metadata*を使用してレイヤメタデータを編集するか、*Manage Styles*ボタンを使用してGeoServer上のレイヤスタイルを編集できます。

source: Press the *Layer Info* button to see the layer page
ja: *Layer Info*ボタンを押して、レイヤページを表示

source: Create a new map
ja: 新規マップの作成

source: The next step for you is to create a map and add the newly created layers to this map.
ja: 次のステップは、マップを作成し、新しく作成したレイヤをこのマップに追加することです。

source: Click the *Explore Maps* link on the *Maps* toolbar. This will bring up the list of maps.
ja: [*Maps*]ツールバーの[*Explore Maps*]リンクをクリックします。これにより、地図の一覧が表示されます。

source: Currently, there aren't any maps here. To add one click the *Create a New Map* button.
ja: 現在、地図はありません。追加するには、*Create a New Map* ボタンをクリックします。

source: A map composition interface will display.
ja: マップ合成インターフェイスが表示されます。

source: If a 404 popup message appears, ignore it, this is due to a missing GeoServer plugin that is not installed on OSGeoLive.
ja: 404ポップアップメッセージが表示された場合は無視してください。これは、OSGeoLiveにインストールされていないGeoServerプラグインが存在しないためです。

source: In this interface there is a toolbar, layer list, and map window. The map window contains the OpenStreetMap layer by default.
ja: このインターフェイスには、ツールバー、レイヤ一覧、マップウィンドウがあります。マップウィンドウには、既定でOpenStreetMapレイヤが表示されます。

source: Click on the *New Layers* button and select *Add Layers*.
ja: *New Layers* ボタンをクリックし、 *Add Layers*を選択します。

source: Now you should be able to see all the available layers. In this case, this should include the ones you've added before.
ja: これで、利用可能なすべてのレイヤーが表示されます。この場合、これには前に追加したものが含まれます。

source: Select some layers by clicking the first entry and Ctrl-clicking the rest.
ja: 最初の項目をクリックし、Ctrlキーを押しながら残りの項目をクリックして、いくつかのレイヤーを選択します。

source: Click *Add Layers* to add them all to the map.
ja: *Add Layers*をクリックして、すべてのレイヤをマップに追加します。

source: The layers will be added to the map.
ja: レイヤーがマップに追加されます。

source: To save the map click on the *Map* button in the toolbar, and select *Save Map*.
ja: マップを保存するには、ツールバーの*Map* ボタンをクリックし、 *Save Map*を選択します。

source: Enter a title and abstract for your map.
ja: マップのタイトルと要約を入力してください。

source: Click *Save*. Notice that the link on the top right of the page changed to reflect the map's name.
ja: *保存*をクリックします。ページの右上のリンクが、マップの名前を反映するように変更されていることに注意してください。

source: This link contains a permalink to your map. If you open this link in a new window, your map will appear exactly as it was saved.
ja: このリンクには、マップへのパーマリンクが含まれています。このリンクを新しいウィンドウで開くと、マップは保存された状態で表示されます。

source: Click *Done* next to the *Add Layers* button to see the legend of your map.
ja: *Add Layers*ボタンの横の*Done*をクリックして、マップの凡例を表示します。

source: Share your map
ja: あなたのマップを共有

source: Now let's finish our map.
ja: 次に、マップを終了します。

source: Right click on the *USA Population* layer and select *Zoom to layer extend*
ja: *USA Population*レイヤを右クリックして、 *Zoom to layer extend*を選択します。

source: Make any final adjustments to the map composition as desired, including zoom and pan settings.
ja: ズームやパンの設定など、必要に応じてマップの構成を最終的に調整します。

source: Click the *Map* button in the toolbar, and then click *Publish Map*.
ja: ツールバーの *Map*ボタンをクリックし、*Publish Map*をクリックします。

source: The title and abstract as previously created should still be there. Make any adjustments as necessary, and click *Save*.
ja: 前に作成したタイトルと要約が残っているはずです。必要に応じて調整し、 *Save*をクリックします。

source: A new dialog will appear with instructions on how to embed this map in a webpage, including a code snippet. You can adjust the parameters as necessary.
ja: 新しいダイアログが表示され、このマップをWebページに埋め込む方法がコードスニペットを含めて指示されます。必要に応じてパラメータを調整できます。

source: Your map can now be shared.
ja: これで、マップを共有できます。

source: What next?
ja: 次のステップ

source: Now you've gotten a quick insight in the possibilities of GeoNode. To learn more about GeoNode and its features, visit our webpage www.geonode.org.
ja: これで、GeoNodeの可能性について簡単に理解できました。GeoNodeとその機能の詳細については、Webページwww.geonode.orgを参照してください。

source: To install GeoNode on your own server, follow our `Quick Installation Guide <https://docs.geonode.org/en/master/start/index.html#quick-installation-guide>`_ .
ja: GeoNodeを独自のサーバーにインストールするには、`クイックインストールガイド<https://docs.geonode.org/en/master/start/index.html#quick-installation-guide>`_に従ってください。

source: In order to get started with GeoNode our `documentation <https://docs.geonode.org/en/master/>`_ might be useful.
ja: GeoNodeを使用するには、`documentation<https://docs.geonode.org/en/master/>`_が便利です。

source: If you need help or want to get some information about a specific topic please don't hasitate to ask us! You can do this through the #geonode IRC channel using https://webchat.freenode.net/, through the `GeoNode Gitter channel <https://gitter.im/GeoNode/general>`_ or by asking your question in our `mailing list <https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-users>`_ !
ja: ヘルプが必要な場合や、特定のトピックに関する情報を取得したい場合は、遠慮なくお問い合わせください。https://webchat.freenode.net/ の #geonode IRCチャネルを使用したり、`GeoNode Gitterチャネル<https://gitter.im/GeoNode/general>`_ にアクセスしたり、または私たちの`メーリングリスト<https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-users>`_!で質していただけます。問
